# NewFamilyId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadedIntoDocumentEventArgs..::..NewFamilyId Property
FamilyLoadedIntoDocumentEventArgs Class See Also
---
The newly loaded family id.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId NewFamilyId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewFamilyId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ NewFamilyId {
	ElementId^ get ();
}
```

# See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace